{
  "metadata": {
    "total_size": 13298573312
  },
  "weight_map": {
    "transformer.blocks.0.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.0.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.0.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.0.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.0.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.0.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.1.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.1.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.1.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.1.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.1.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.1.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.10.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.10.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.10.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.10.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.10.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.10.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.11.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.11.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.11.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.11.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.11.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.11.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.12.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.12.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.12.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.12.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.12.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.12.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.13.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.13.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.13.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.13.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.13.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.13.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.14.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.14.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.14.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.14.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.14.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.14.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.15.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.15.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.15.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.15.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.15.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.15.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.16.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.16.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.16.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.16.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.16.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.16.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.17.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.17.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.17.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.17.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.17.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.17.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.18.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.18.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.18.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.18.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.18.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.18.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.19.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.19.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.19.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.19.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.19.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.19.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.2.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.2.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.2.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.2.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.2.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.2.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.20.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.20.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.20.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.20.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.20.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.20.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.21.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.21.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.21.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.21.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.21.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.21.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.22.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.22.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.22.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.22.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.22.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.22.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.23.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.23.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.23.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.23.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.23.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.23.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.24.attn.Wqkv.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.24.attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.24.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.24.ffn.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.24.norm_1.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.24.norm_2.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.25.attn.Wqkv.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.25.attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.25.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.25.ffn.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.25.norm_1.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.25.norm_2.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.26.attn.Wqkv.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.26.attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.26.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.26.ffn.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.26.norm_1.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.26.norm_2.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.27.attn.Wqkv.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.27.attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.27.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.27.ffn.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.27.norm_1.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.27.norm_2.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.28.attn.Wqkv.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.28.attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.28.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.28.ffn.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.28.norm_1.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.28.norm_2.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.29.attn.Wqkv.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.29.attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.29.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.29.ffn.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.29.norm_1.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.29.norm_2.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.3.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.3.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.3.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.3.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.3.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.3.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.30.attn.Wqkv.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.30.attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.30.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.30.ffn.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.30.norm_1.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.30.norm_2.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.31.attn.Wqkv.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.31.attn.out_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.31.ffn.down_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.31.ffn.up_proj.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.31.norm_1.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.31.norm_2.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.blocks.4.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.4.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.4.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.4.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.4.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.4.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.5.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.5.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.5.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.5.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.5.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.5.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.6.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.6.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.6.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.6.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.6.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.6.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.7.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.7.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.7.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.7.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.7.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.7.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.8.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.8.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.8.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.8.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.8.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.8.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.9.attn.Wqkv.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.9.attn.out_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.9.ffn.down_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.9.ffn.up_proj.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.9.norm_1.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.blocks.9.norm_2.weight": "pytorch_model-00001-of-00002.bin",
    "transformer.norm_f.weight": "pytorch_model-00002-of-00002.bin",
    "transformer.wte.weight": "pytorch_model-00001-of-00002.bin"
  }
}
